In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [2]:
df = pd.read_csv('E:/FinancialDataMining/data/OnlineRetail_practice.csv')

In [3]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Class
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,high
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,mid
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,low
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,low
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,low

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15275 entries, 0 to 15274
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    15275 non-null  object
 1   StockCode    15275 non-null  object
 2   Description  15215 non-null  object
 3   Quantity     15275 non-null  int64
 4   InvoiceDate  15275 non-null  object
 5   UnitPrice    15275 non-null  float64
 6   CustomerID   10768 non-null  float64
 7   Country      15275 non-null  object
 8   Class        15275 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 1.0+ MB

In [5]:
df.describe()

           Quantity     UnitPrice    CustomerID
count  15275.000000  15275.000000  10768.000000
mean       7.386121      5.875644  15595.984305
std       85.154136    156.172698   1763.149555
min    -9360.000000      0.000000  12347.000000
25%        1.000000      1.250000  14236.750000
50%        2.000000      2.510000  15708.000000
75%        6.000000      4.210000  17218.000000
max     2880.000000  13541.330000  18239.000000

In [6]:
# df.isnull().sum()
df.isna().sum()

InvoiceNo         0
StockCode         0
Description      60
Quantity          0
InvoiceDate       0
UnitPrice         0
CustomerID     4507
Country           0
Class             0
dtype: int64

## 결측치 처리

### 1

df = df.dropna()
df.info()

### 2

In [7]:
# pd.notnull(df['CustomerID']) => 시리즈 반환
df = df[pd.notnull(df['CustomerID'])]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10768 entries, 0 to 15045
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    10768 non-null  object
 1   StockCode    10768 non-null  object
 2   Description  10768 non-null  object
 3   Quantity     10768 non-null  int64
 4   InvoiceDate  10768 non-null  object
 5   UnitPrice    10768 non-null  float64
 6   CustomerID   10768 non-null  float64
 7   Country      10768 non-null  object
 8   Class        10768 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 841.2+ KB

## 이상치 처리

In [9]:
df = df[df['Quantity']>0]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10617 entries, 0 to 15045
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    10617 non-null  object
 1   StockCode    10617 non-null  object
 2   Description  10617 non-null  object
 3   Quantity     10617 non-null  int64
 4   InvoiceDate  10617 non-null  object
 5   UnitPrice    10617 non-null  float64
 6   CustomerID   10617 non-null  float64
 7   Country      10617 non-null  object
 8   Class        10617 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 829.5+ KB

In [11]:
df.describe()

           Quantity     UnitPrice    CustomerID
count  10617.000000  10617.000000  10617.000000
mean      10.544598      3.070126  15598.064896
std       45.732462      4.587039   1763.597277
min        1.000000      0.000000  12347.000000
25%        1.000000      1.250000  14237.000000
50%        4.000000      2.100000  15708.000000
75%       12.000000      3.750000  17218.000000
max     2880.000000    295.000000  18239.000000

## Dtype == object 확인

In [12]:
# unique의 개수 확인
print(df['Country'].nunique())
print(df['Class'].nunique())
print(df['StockCode'].nunique())

16
3
1846

In [13]:
# value별 개수 확인
df['Country'].value_counts()

United Kingdom    9882
Germany            197
France             167
EIRE               132
Norway              73
Lithuania           34
Iceland             31
Italy               24
Japan               16
Portugal            14
Australia           14
Belgium             12
Poland               8
Switzerland          6
Spain                5
Netherlands          2
Name: Country, dtype: int64

In [14]:
df['Class'].value_counts()

mid     5968
low     3430
high    1219
Name: Class, dtype: int64

In [15]:
df['StockCode'].value_counts()

22633     85
22632     77
22866     77
85123A    75
22086     70
          ..
17084J     1
22164      1
21746      1
79190A     1
20684      1
Name: StockCode, Length: 1846, dtype: int64

## Dtype 변경

In [16]:
df['CustomerID'] = df['CustomerID'].astype('int32')
df['InvoiceDate'] = df['InvoiceDate'].astype('datetime64')
df['Class'] = df['Class'].astype('category')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10617 entries, 0 to 15045
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    10617 non-null  object
 1   StockCode    10617 non-null  object
 2   Description  10617 non-null  object
 3   Quantity     10617 non-null  int64
 4   InvoiceDate  10617 non-null  datetime64[ns]
 5   UnitPrice    10617 non-null  float64
 6   CustomerID   10617 non-null  int32
 7   Country      10617 non-null  object
 8   Class        10617 non-null  category
dtypes: category(1), datetime64[ns](1), float64(1), int32(1), int64(1), object(4)
memory usage: 715.5+ KB

## Class를 수치형으로 변경

In [18]:
# 알파벳 순서로 인코딩
le = LabelEncoder()
df['Class'] = le.fit_transform(df['Class'])
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Class
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,0
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,1
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,1
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,1

In [19]:
df['Class'].value_counts()

2    5968
1    3430
0    1219
Name: Class, dtype: int64

In [20]:
# 인코딩을 1, 2, 3으로 변경
df['Class'] = df['Class'].replace(to_replace = [0, 1, 2], value = [1, 2, 3])

In [21]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Class
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,1
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,3
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,2
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2

## 파생변수 생성

In [22]:
df['Price'] = df['Quantity'] * df['UnitPrice']
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Class,Price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,1,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,3,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,2,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2,20.34

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10617 entries, 0 to 15045
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    10617 non-null  object
 1   StockCode    10617 non-null  object
 2   Description  10617 non-null  object
 3   Quantity     10617 non-null  int64
 4   InvoiceDate  10617 non-null  datetime64[ns]
 5   UnitPrice    10617 non-null  float64
 6   CustomerID   10617 non-null  int32
 7   Country      10617 non-null  object
 8   Class        10617 non-null  int64
 9   Price        10617 non-null  float64
dtypes: datetime64[ns](1), float64(2), int32(1), int64(2), object(4)
memory usage: 870.9+ KB

## df 저장

In [24]:
df.to_csv('E:/FinancialDataMining/data/cleaned_retail.csv', index = False)

In [25]:
df1 = pd.read_csv('E:/FinancialDataMining/data/cleaned_retail.csv')
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10617 entries, 0 to 10616
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    10617 non-null  int64
 1   StockCode    10617 non-null  object
 2   Description  10617 non-null  object
 3   Quantity     10617 non-null  int64
 4   InvoiceDate  10617 non-null  object
 5   UnitPrice    10617 non-null  float64
 6   CustomerID   10617 non-null  int64
 7   Country      10617 non-null  object
 8   Class        10617 non-null  int64
 9   Price        10617 non-null  float64
dtypes: float64(2), int64(4), object(4)
memory usage: 829.6+ KB

In [26]:
df1.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Class,Price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,1,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,3,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,2,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,2,20.34

## Groupby

In [27]:
#df1.groupby(['Country']).sum(['Price'])
df1.groupby(['Country']).sum()

                 InvoiceNo  Quantity  UnitPrice  CustomerID  Class      Price
Country
Australia          7509446       107      73.90      174034     14     358.25
Belgium            6444312       528      37.41      148740     24     346.10
EIRE              70885505      3238     657.45     1965987    279    3788.23
France            89697386      2051     614.80     2106356    407    4257.14
Germany          105816309      2081     735.82     2481770    559    4242.29
Iceland           16666406       319      89.59      382757     93     711.79
Italy             12888528       164      98.50      305400     48     427.80
Japan              8595488       196      28.99      204208     48     320.08
Lithuania         18260803       622      97.34      521288    102    1598.06
Netherlands        1072806        97      16.85       25582      2     192.60
Norway            39166836      1852     102.67      907609    103    1919.14
Poland             4295768       140      18.99      102232     16     248.16
Portugal           7519652       118      78.50      179207     35     261.20
Spain              2684720       400       7.85       62785     10     620.00
Switzerland        3221148       110      55.45       81120     12     303.40
United Kingdom  5306631162     99929   29881.42   155955580  24231  187104.97

In [28]:
df1.groupby(['Country']).sum().sort_values(by = 'Price', ascending = False)

                 InvoiceNo  Quantity  UnitPrice  CustomerID  Class      Price
Country
United Kingdom  5306631162     99929   29881.42   155955580  24231  187104.97
France            89697386      2051     614.80     2106356    407    4257.14
Germany          105816309      2081     735.82     2481770    559    4242.29
EIRE              70885505      3238     657.45     1965987    279    3788.23
Norway            39166836      1852     102.67      907609    103    1919.14
Lithuania         18260803       622      97.34      521288    102    1598.06
Iceland           16666406       319      89.59      382757     93     711.79
Spain              2684720       400       7.85       62785     10     620.00
Italy             12888528       164      98.50      305400     48     427.80
Australia          7509446       107      73.90      174034     14     358.25
Belgium            6444312       528      37.41      148740     24     346.10
Japan              8595488       196      28.99      204208     48     320.08
Switzerland        3221148       110      55.45       81120     12     303.40
Portugal           7519652       118      78.50      179207     35     261.20
Poland             4295768       140      18.99      102232     16     248.16
Netherlands        1072806        97      16.85       25582      2     192.60

In [29]:
df1.groupby(['Country']).sum()['Price'].sort_values(ascending = False)

Country
United Kingdom    187104.97
France              4257.14
Germany             4242.29
EIRE                3788.23
Norway              1919.14
Lithuania           1598.06
Iceland              711.79
Spain                620.00
Italy                427.80
Australia            358.25
Belgium              346.10
Japan                320.08
Switzerland          303.40
Portugal             261.20
Poland               248.16
Netherlands          192.60
Name: Price, dtype: float64

In [30]:
df1.groupby(['CustomerID']).count()['InvoiceDate'].sort_values(ascending=False)

CustomerID
12748    314
17850    297
13174    169
17841    140
14911    129
        ...
13798      1
17616      1
15823      1
15769      1
13145      1
Name: InvoiceDate, Length: 416, dtype: int64

# 연습

In [31]:
df1.groupby(['CustomerID']).sum()['Price'].sort_values(ascending=False)

CustomerID
15061    11429.50
13777     6585.16
17850     5391.21
16210     4738.54
16029     4271.52
           ...
17965       37.35
14865       37.20
14576       35.40
17026       33.15
15823       15.00
Name: Price, Length: 416, dtype: float64